package com.suven.framework.util.ids;
/**
 * id生成器分配区间段
 *  业务号分配
 *	业务号采用分段制，暂定9位数字，"xxx,fff,fff", 高三位xxx表示分段号，统一规划，低6由业务部门内部分配
 *	业务号原则：同一个业务采用的业务号必须保持不变，不同的业务之间的重号不影响id的正确性	
 *	MV(4001) 移动直播送礼(4002) 消费流水(4003)
 */
public interface IdConstants {
	/** MV评论(4001001)*/
    long MV_DISCUSS_ID = 4001001;

	/** MV视频生成(4001002)*/
    long MV_SHOT_ID = 4001002;
	
	
	/*==================移动直播 start========================*/
	/** 房间送礼物全局id(4002001)*/
    long MOBILE_GIFT_ID = 4002001;

	/*================移动直播 end============================*/
	
	/** 消费流水id(4003001)*/
    long CONSUME_LOG_ID = 4003001;
	
	
	/** 移动直播开播流水id(4003002)*/
    long MOBILE_LIVE_ON_ID = 4003002;

}
